quickstarts/bean-service/src/test/resources/xml/soap-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Header/>
    <soap:Body>
        <orders:submitOrder xmlns:orders="urn:switchyard-quickstart:bean-service:1.0">
            <order>
                <orderId>PO-19838-XYZ</orderId>
                <itemId>BUTTER</itemId>
                <quantity>200</quantity>
            </order>
        </orders:submitOrder>
    </soap:Body>
</soap:Envelope>
